app/Models/Blog/Category.php

    public function hasPost()
    {
        return $this->posts()->count() > 0;
---
select count(*) as aggregate from `blog_posts` where `blog_posts`.`blog_category_id` = 1 and `blog_posts`.`blog_category_id` is not null