routes/web.php

|
*/

Route::get('/', function () {
    $post = App\Models\Blog\Post::latest()->get()->where('published_at', '<', now())->take(4);

    return view('welcome', ['posts' => $post]);
})->name('home');
---
select * from `blog_posts` order by `created_at` desc