<?php

return [
    "login" => [
        "username_or_email" => "نام کاربری یا ایمیل",
        "forgot_password_link" => "رمز عبور را فراموش کرده اید؟",
        "create_an_account" => "یک حساب کاربری ایجاد کنید",
    ],
    "password_confirm" => [
        "heading" => "تایید رمز عبور",
        "description" => "لطفاً رمز عبور خود را برای تکمیل این اقدام تأیید کنید.",
        "current_password" => "رمز عبور فعلی"
    ],
    "two_factor" => [
        "heading" => "اهراز هویت دومرحله ای",
        "description" => "لطفاً با وارد کردن کد احراز هویت ارائه شده توسط برنامه احراز هویت خود، دسترسی به حساب خود را تأیید کنید.",
        "code_placeholder" => "XXX-XXX",
        "recovery" => [
            "heading" => "اهراز هویت دومرحله ای",
            "description" => "لطفاً با وارد کردن یکی از کدهای بازیابی اضطراری خود، دسترسی به حساب خود را تأیید کنید.",
        ],
        "recovery_code_placeholder" => "abcdef-98765",
        "recovery_code_text" => "کدراگم کرده اید?",
        "recovery_code_link" => "استفاده از رمز بازنشانی",
        "back_to_login_link" => "برگشت به صفحه ورود"
    ],
    "registration" => [
        "title" => "ثبت نام",
        "heading" => "ساختن اکانت کاربری جدید",
        "submit" => [
            "label" => "ثبت نام",
        ],
        "notification_unique" => "اکانت کاربری با ایمیل شما قبلا ثبت شده ، لطفا با ایمیلی دیگر تلاش بفرمایید.",
    ],
    "reset_password" => [
        "title" => "فراموشی رمز عبور",
        "heading" => "بازنشانی رمز عبور",
        "submit" => [
            "label" => "ارسال",
        ],
        "notification_error" => "خطایی رخ داده، در فرصتی دیگر تلاش بفرمایید.",
        "notification_success" => "رمز بازنشانی با موفقیت ارسال شد!",
    ],
    "verification" => [
        "title" => "تأیید ایمیل",
        "heading" => "تأیید ایمیل مورد نیاز است",
        "submit" => [
            "label" => "خروج از سیستم",
        ],
        "notification_success" => "صندوق ورودی ایمیل خود را برای اقدام بعدی بررسی کنید!",
        "notification_resend" => "ایمیل تأیید دوباره ارسال شد.",
        "before_proceeding" => "قبل از ادامه، لطفاً ایمیل خود را برای لینک تأیید بررسی کنید.",
        "not_receive" => "اگر ایمیل را دریافت نکردید،",
        "request_another" => "برای درخواست یکی دیگر اینجا را کلیک کنید",
    ],
    "profile" => [
        "account" => "حساب کاربری",
        "profile" => "پروفایل",
        "my_profile" => "پروفایل من",
        "personal_info" => [
            "heading" => "اطلاعات شخصی",
            "subheading" => "اطلاعات شخصی خود را مدیریت کنید",
            "submit" => [
                "label" => "بروزرسانی",
            ],
            "notify" => "پروفایل با موفقیت به روز شد!",
        ],
        "password" => [
            "heading" => "گذر واژه",
            "subheading" => "باید 8 کاراکتر باشد.",
            "submit" => [
                "label" => "بروزرسانی",
            ],
            "notify" => "گذر واژه با موفقیت بروزرسانی شد!",
        ],
        "2fa" => [
            "title" => "اهراز هویت دو مرحله ای",
            "description" => "احراز هویت 2 عاملی را برای حساب خود مدیریت کنید ( پیشنهاد میشود ).",
            "actions" => [
                "enable" => "فعال",
                "regenerate_codes" => "تولید از دوباره کد بازنشانی",
                "disable" => "غیر فعال",
                "confirm_finish" => "تایید کنید و تمام کنید",
                "cancel_setup" => "لغو راه اندازی"
            ],
            "setup_key" => "راه اندازی کلید",
            "not_enabled" => [
                "title" => "شما احراز هویت دو عاملی را فعال نکرده اید.",
                "description" => "هنگامی که احراز هویت دو عاملی فعال باشد، در حین احراز هویت از شما خواسته می شود که یک نشانه امن و تصادفی داشته باشید. می توانید این نشانه را از برنامه Google Authenticator گوشی خود بازیابی کنید."
            ],
            "finish_enabling" => [
                "title" => "فعال کردن احراز هویت دو عاملی را به پایان برسانید.",
                "description" => "برای پایان دادن به فعال کردن احراز هویت دو عاملی، کد QR زیر را با استفاده از برنامه احراز هویت گوشی خود اسکن کنید یا کلید تنظیم را وارد کرده و کد OTP تولید شده را ارائه دهید."
            ],
            "enabled" => [
                "title" => "شما احراز هویت دو عاملی را فعال کرده اید!",
                "description" => "احراز هویت دو عاملی اکنون فعال است. کد QR زیر را با استفاده از برنامه احراز هویت گوشی خود اسکن کنید یا کلید تنظیم را وارد کنید.",
                "store_codes" => "این کدهای بازیابی را در یک مدیر رمز عبور امن ذخیره کنید. اگر دستگاه احراز هویت دو عاملی شما گم شود، می توان از آنها برای بازیابی دسترسی به حساب شما استفاده کرد.",
                "show_codes" => 'نمایش کدهای بازیابی',
                "hide_codes" => 'پنهان کردن کدهای بازیابی'
            ],
            "confirmation" => [
                "success_notification" => 'کد تایید شد احراز هویت دو عاملی فعال شد.',
                "invalid_code" => "کدی که وارد کرده اید نامعتبر است."
            ]
        ],
        "sanctum" => [
            "title" => "API توکن های",
            "description" => "توکن‌های API را مدیریت کنید که به سرویس‌های شخص ثالث اجازه می‌دهند از طرف شما به این برنامه دسترسی داشته باشند. توجه: رمز شما یک بار پس از ایجاد نشان داده می شود. اگر توکن خود را گم کردید، باید آن را حذف کرده و یک رمز جدید ایجاد کنید.",
            "create" => [
                "notify" => "توکن با موفقیت ایجاد شد!",
                "submit" => [
                    "label" => "Create",
                ],
            ],
            "update" => [
                "notify" => "Token updated successfully!",
            ],
        ],
    ],
    "fields" => [
        "email" => "ایمیل",
        "login" => "ورود",
        "name" => "نام",
        "password" => "گذرواژه",
        "password_confirm" => "تایید گذرواژه",
        "new_password" => "گذرواژه جدید",
        "new_password_confirmation" => "تایید گذرواژه",
        "token_name" => "نام توکن",
        "abilities" => "توانایی ها",
        "2fa_code" => "کد",
        "2fa_recovery_code" => "کد بازیابی"
    ],
    "or" => "یا",
    "cancel" => "لغو"
];
