<?php

return [
    'page' => [
        'title' => 'گزارش های سایت'
    ],
    'forms' => [
        'search' => [
            'placeholder' => 'یک فایل گزارش را انتخاب یا جستجو کنید...'
        ]
    ],
    'modals' => [
        'clear' => [
            'heading' => 'گزارش های سایت پاک شود؟',
            'subheading' => 'آیا مطمئن هستید که می خواهید تمام گزارش های سایت را پاک کنید؟',
            'actions' => [
                'cancel' => 'لغو',
                'confirm' => 'گزارش ها را پاک کنید'
            ]
        ]
    ]
];
